In [20]:
from geopy.geocoders import ArcGIS

In [45]:
t = ArcGIS()

In [21]:
import certifi

In [24]:
non.geocode("1263 W Cleveland St, Fayetteville, AR 72701")

Location(1263 W Cleveland St, Fayetteville, Arkansas, 72701, (36.073965513417114, -94.1786232799065, 0.0))

In [25]:
non

In [26]:
import pandas

In [27]:
df1 = pandas.read_csv('supermarkets.csv')

In [28]:
df1

,ID,Address,City,State,Country,Name,Employees
0,1,3666 21st St,San Francisco,CA 94114,USA,Madeira,8
1,2,735 Dolores St,San Francisco,CA 94119,USA,Bready Shop,15
2,3,332 Hill St,San Francisco,California 94114,USA,Super River,25
3,4,3995 23rd St,San Francisco,CA 94114,USA,Ben's Shop,10
4,5,1056 Sanchez St,San Francisco,California,USA,Sanchez,12
5,6,551 Alvarado St,San Francisco,CA 94114,USA,Richvalley,20

In [29]:
df = df1

In [30]:
df['Address'] = df['Address'] + ', ' + df['City'] + ', ' + df['State']

In [31]:
df

,ID,Address,City,State,Country,Name,Employees
0,1,"3666 21st St, San Francisco, CA 94114",San Francisco,CA 94114,USA,Madeira,8
1,2,"735 Dolores St, San Francisco, CA 94119",San Francisco,CA 94119,USA,Bready Shop,15
2,3,"332 Hill St, San Francisco, California 94114",San Francisco,California 94114,USA,Super River,25
3,4,"3995 23rd St, San Francisco, CA 94114",San Francisco,CA 94114,USA,Ben's Shop,10
4,5,"1056 Sanchez St, San Francisco, California",San Francisco,California,USA,Sanchez,12
5,6,"551 Alvarado St, San Francisco, CA 94114",San Francisco,CA 94114,USA,Richvalley,20

In [37]:
df = df.drop(['City', 'State'], 1)

In [38]:
df

,ID,Address,Country,Name,Employees
0,1,"3666 21st St, San Francisco, CA 94114",USA,Madeira,8
1,2,"735 Dolores St, San Francisco, CA 94119",USA,Bready Shop,15
2,3,"332 Hill St, San Francisco, California 94114",USA,Super River,25
3,4,"3995 23rd St, San Francisco, CA 94114",USA,Ben's Shop,10
4,5,"1056 Sanchez St, San Francisco, California",USA,Sanchez,12
5,6,"551 Alvarado St, San Francisco, CA 94114",USA,Richvalley,20

In [39]:
df = df.set_index('ID')

In [40]:
df

,Address,Country,Name,Employees
ID,,,,
1,"3666 21st St, San Francisco, CA 94114",USA,Madeira,8
2,"735 Dolores St, San Francisco, CA 94119",USA,Bready Shop,15
3,"332 Hill St, San Francisco, California 94114",USA,Super River,25
4,"3995 23rd St, San Francisco, CA 94114",USA,Ben's Shop,10
5,"1056 Sanchez St, San Francisco, California",USA,Sanchez,12
6,"551 Alvarado St, San Francisco, CA 94114",USA,Richvalley,20

In [72]:
df['Coordinates'] = df['Address'].apply(t.geocode)

In [76]:
df['Latitude'] = df['Coordinates'].apply(lambda x: x.latitude if x != None else None)
df['Longitude'] = df['Coordinates'].apply(lambda x: x.longitude if x != None else None)

In [79]:
df = df.drop('Coordinates', 1)

In [80]:
df

,Address,Country,Name,Employees,Latitude,Longitude
ID,,,,,,
1,"3666 21st St, San Francisco, CA 94114",USA,Madeira,8,37.756444,-122.429353
2,"735 Dolores St, San Francisco, CA 94119",USA,Bready Shop,15,37.757801,-122.425599
3,"332 Hill St, San Francisco, California 94114",USA,Super River,25,37.755641,-122.428794
4,"3995 23rd St, San Francisco, CA 94114",USA,Ben's Shop,10,37.752985,-122.431702
5,"1056 Sanchez St, San Francisco, California",USA,Sanchez,12,37.752144,-122.429758
6,"551 Alvarado St, San Francisco, CA 94114",USA,Richvalley,20,37.753709,-122.433251